000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РегистрацияОбъектов/РегистрацияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацияОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДействиеКоманда</name>
    <comment>Задается литерально для облегчения использования в коде</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
      <types>CatalogRef.СерийныеНомера</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЧековККМ</name>
  <enumValues>
    <name>Отложенный</name>
  </enumValues>
  <enumValues>
    <name>Аннулированный</name>
  </enumValues>
  <enumValues>
    <name>Пробитый</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Корзина</name>
      <description>КОРЗИНА</description>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
    </items>
  </predefined>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>(Регл) Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>LNK. Может выступать в роли покупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>LNK. Может выступать в роли поставщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрямуюЗакупку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>CatalogRef.ФормаСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркетинговыеГруппы</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.МаркетинговыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/РозничныеПродажиСлужебный/Module.bsl
//	LNK 12.08.2019 08:55:10
Функция РесурсMicrosoftDynamicsДоступен(Обновить = Ложь)	Экспорт

	Возврат Ложь;

КонецФункции

//	LNK 12.08.2019 11:18:47
Функция РесурсWebRetailДоступен(Обновить = Ложь)	Экспорт

	РесурсДоступен = Константы.РесурсWebRetailДоступен.Получить();

	Если Обновить = Истина ИЛИ НЕ РесурсДоступен Тогда

		Попытка

			ФоновыеЗадания.Выполнить("ОбменWebRetailСервер.ПроверкаДоступностиWebRetail"
				, ОбщегоНазначенияКлиентСервер.AAD(Ложь)
				, "ПРОВЕРКА_СОЕДИНЕНИЯ"
			);

		Исключение

		//	запуск фонового технический.. не случилось и хорошо.
			ТекстОшибки = ОписаниеОшибки();

		КонецПопытки;

	КонецЕсли;

	Возврат РесурсДоступен;

КонецФункции

#Область КомплексРаботСДаннымиКонтрагентовВРознице

//	LNK 16.08.2019 09:41:58
Функция ВыполнитьКомплексДанныхКонтрагента(КодКарты, НомерТелефона, ДанныеКонтрагента, НазначениеДанных, ДокументПродажи, ВыполнениеРегламента = Ложь, КонтрольНаличия = Ложь)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	СоставДанных = ОбменMicrosoftDynamicsСервер.ИнициализироватьСоставДанных();

	Если Справочники.Контрагенты.КлючиПоискаУказаны(ДанныеКонтрагента) Тогда

		СоставДанных = Справочники.Контрагенты.НайтиКонтрагентаПоДаннымCRM(ДанныеКонтрагента);

		ТекстДанныеОтложены = "";

		Если СоставДанных.Контрагент = Неопределено И НЕ КонтрольНаличия Тогда

			Если НЕ ВыполнениеРегламента И НЕ ДокументПродажи = Неопределено Тогда

			//	Данные контрагента "откладываем" в том случае, если контрагент НЕ найден.
				Справочники.Контрагенты.ОтложитьДанныеКонтрагента(КодКарты, НомерТелефона, ДанныеКонтрагента, НазначениеДанных, ДокументПродажи, ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);
				ТекстДанныеОтложены = Символы.ПС + "Отложены данные КАРТА[" + КодКарты + "], ТЕЛ[" + НомерТелефона + "]";

			КонецЕсли;

			Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

				Если ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДанныеКонтрагента, "РазрешеноСозданиеНового", Истина) = Истина Тогда

					СоставДанных = Справочники.Контрагенты.ПрименитьКонтрагентаПоДаннымCRM(ДанныеКонтрагента, СоставДанных,, Ложь);

				КонецЕсли;

			Иначе

				Если РозничныеПродажиСлужебный.РесурсWebRetailДоступен() Тогда

					Попытка

						Подключение  = СервисыСервер.Подключение("RetailPack");
						СоставДанных = ОбщегоНазначенияКлиентСервер.ДесериализоватьJSON(Подключение.GetBuyerFromCRMData(ОбщегоНазначенияКлиентСервер.СериализоватьJSON(Новый ХранилищеЗначения(ДанныеКонтрагента, Новый СжатиеДанных(9)))));

						Если СоставДанных.Ошибка = Ложь Тогда

							Если СоставДанных.Свойство("Объекты") Тогда

							//	Из ЦБ получены объекты - Контрагент и его карта!
							//	Рассматриваем эти данные, как вариант синхронизации.. обновим локальную информацию.

								СоставДанных.Объекты.Контрагент.ОбменДанными.Загрузка = Истина;
								СоставДанных.Объекты.Контрагент.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
								СоставДанных.Объекты.Контрагент.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);

								СоставДанных.Объекты.Контрагент.Записать();	//	теперь локальный объект соответствует данным ЦБ!

							//	LNK 13.09.2022 17:39:36 -	Карту, полученную из ЦБ, переписываем в любом случае!
								Если ЗначениеЗаполнено(СоставДанных.ДисконтнаяКарта) Тогда

									СоставДанных.Объекты.ДисконтнаяКарта.ОбменДанными.Загрузка = Истина;
									СоставДанных.Объекты.ДисконтнаяКарта.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
									СоставДанных.Объекты.ДисконтнаяКарта.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);

									СоставДанных.Объекты.ДисконтнаяКарта.Записать();

								КонецЕсли;

							КонецЕсли;

						Иначе

							ЖурналСобытий.Регистрация("Контрагенты.MSCRM.RetailPack", УровеньЖурналаРегистрации.Ошибка
							,,,, "Ошибка получения данных:" + Символы.ПС + СоставДанных.ОписаниеОшибки,, Ложь);

						КонецЕсли;

					Исключение

						СоставДанных = ОбменMicrosoftDynamicsСервер.ИнициализироватьСоставДанных();

						СоставДанных.Ошибка = Истина;
						СоставДанных.ОписаниеОшибки = ОписаниеОшибки();

						ЖурналСобытий.Регистрация("Контрагенты.MSCRM.RetailPack", УровеньЖурналаРегистрации.Ошибка,,,, "Ошибка передачи:" + Символы.ПС + СоставДанных.ОписаниеОшибки,, Ложь);

					КонецПопытки;

				Иначе

					ЖурналСобытий.Регистрация("Контрагенты.MSCRM.RetailPack", УровеньЖурналаРегистрации.Информация,,,, "Ресурс «WebRetail» НЕДОСТУПЕН. Получить данные из ЦБ невозможно." + ТекстДанныеОтложены,, Ложь);

				КонецЕсли;

			КонецЕсли;

			Если СоставДанных.Свойство("Объекты") Тогда

				СоставДанных.Удалить("Объекты");

			КонецЕсли;

		КонецЕсли;

	Иначе

		СоставДанных.Ошибка = Истина;
		СоставДанных.ОписаниеОшибки = "Внешняя система не вернула обязательные ключи поиска.";

	КонецЕсли;

	Возврат СоставДанных;

КонецФункции

#КонецОбласти

//	LNK 07.12.2021 05:55:45
Функция ПроверитьПереданныеВЦентрЧеки(Контрагент)	Экспорт

	Отказ = Ложь;

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаНазначение.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.РегистрацияОбъектов КАК ТаблицаНазначение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК Фильтр
		|		ПО ТаблицаНазначение.Объект = Фильтр.Ссылка
		|ГДЕ
		|	ТаблицаНазначение.ДействиеКоманда = ""ПЕРЕДАТЬ_В_ЦЕНТР""
		|	И Фильтр.ВладелецДисконтнойКарты = &Контрагент
		|	И Фильтр.СтатусЧекаККМ В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый), ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Архивный))"
		);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);

		Отказ = НЕ Запрос.Выполнить().Пустой();

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции

#Область КомпонентаГенерацииQRкода

//	LNK 10.04.2023 11:21:39
Функция ПолучитьГенераторQRкода()	Экспорт

	Макет = ПолучитьОбщийМакет("КомпонентаПечатиQRКода");
	ГенераторQRкода = Неопределено;

	Если ПодключитьВнешнююКомпоненту(ПоместитьВоВременноеХранилище(Макет), "QR") тогда

		ГенераторQRкода = Новый("AddIn.QR.QRCodeExtension");

	Иначе

		ВызватьИсключение "Не вдалося підключити компонент генерації QR коду";		

	КонецЕсли;

	Возврат Новый ХранилищеЗначения(ГенераторQRкода);

КонецФункции


#КонецОбласти
